cfg/bi-submit.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:v2="http://xmlns.oracle.com/oxp/service/v2">
   <soapenv:Header/>
   <soapenv:Body>
      <v2:scheduleReport>
         <v2:scheduleRequest>
            <v2:deliveryChannels>
               <v2:ftpOptions>
                  <v2:item>
                     <v2:ftpServerName>OracleSFTP</v2:ftpServerName>
                     <v2:remoteFile>REMOTEFILE</v2:remoteFile>
                     <v2:sftpOption>true</v2:sftpOption>
                  </v2:item>
               </v2:ftpOptions>
            </v2:deliveryChannels>
            <v2:notificationTo>NOTIFICATIONEMAIL</v2:notificationTo>
            <v2:notifyWhenFailed>true</v2:notifyWhenFailed>
            <v2:notifyWhenSkipped>true</v2:notifyWhenSkipped>
            <v2:notifyWhenSuccess>true</v2:notifyWhenSuccess>
            <v2:notifyWhenWarning>true</v2:notifyWhenWarning>
            <v2:reportRequest>
               <v2:flattenXML>true</v2:flattenXML>
               <v2:attributeFormat>text</v2:attributeFormat>
               <v2:attributeLocale>en-UK</v2:attributeLocale>
               <v2:attributeTemplate>assignment</v2:attributeTemplate>
               <v2:attributeTimezone>Europe/London</v2:attributeTimezone>
               <v2:reportAbsolutePath>REPORTFILE</v2:reportAbsolutePath>
               <v2:parameterNameValues>
                  <v2:listOfParamNameValues>
                     <!--Zero or more repetitions:-->
                     <v2:item>
                        <v2:name>reportRunDate</v2:name>
                        <v2:values>
                           <v2:item>REPORTRUNDATE</v2:item>
                        </v2:values>
                     </v2:item>
                  </v2:listOfParamNameValues>
               </v2:parameterNameValues>
               <v2:sizeOfDataChunkDownload>-1</v2:sizeOfDataChunkDownload>
            </v2:reportRequest>
            <v2:saveDataOption>false</v2:saveDataOption>
            <v2:saveOutputOption>true</v2:saveOutputOption>
            <v2:userJobDesc>JOBNAME</v2:userJobDesc>
            <v2:userJobName>JOBNAME_DATESTAMP_TIMESTAMP</v2:userJobName>
         </v2:scheduleRequest>
         <v2:userID>USERNAME</v2:userID>
         <v2:password>PASSWORD</v2:password>
      </v2:scheduleReport>
   </soapenv:Body>
</soapenv:Envelope>
